# Ex 3.1 Getting Data from Files into a *pandas* Dataframe    

- [In Class: CSV](#In-Class:-CSV)  
- [In Class: Excel](#In-Class:-Excel)  


- [Ex 3.1](#Ex-3.1)  
  - Part 1  
  - Part 2  
  - Part 3


- **Data Files Required**  
  - 02.2_Task_SmallData.csv  
  - 02.2_Task_SmallData.xlsx  
  - Femalelist.csv  
  - w3schools_Data_Updated.xlsx

In [110]:
import pandas as pd

# In Class: CSV

###  *02.2_Task_SmallData.csv* 
1. Read the CSV file:  02.2_Task_SmallData.csv 
2. Read the data from the 'Small Data' worksheet into a dataframe named df_Store_CSV  
3. Display the first five rows of the Data Frame

In [111]:
#Read the csv file into a pandas dataframe
#Note: This file is in the Data folder underneath this folder 
df = pd.read_csv('Data//02.2_Task_SmallData.csv')

#Display the first five records/rows in the dataframe
df.head()

   OrderID  Order Date Product  Size (US) Colour  Price ($)
0       10  04/01/2015   Boots         12  Black         25
1        7  03/01/2015   Boots         10  Black         25
2        8  03/01/2015   Boots          9  Black         25
3       11  05/01/2015   Boots          7  Black         25
4        2  02/01/2015   Boots          4  Black         25

In [112]:
# Display the datatypes of the pandas data frame  
df_Task_SmallData.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
dtype: object

# In Class: Excel

###  In Class:  *02.2_Task_SmallData.xlsx* 
1. Read the Excel file:  02.2_Task_SmallData.xlsx 
2. Read the data from the 'Small Data' worksheet inta dataframes named df_Store_Excel
3. Display the first five rows of the Data Frame

In [113]:
# Set path to Excel file
file = 'Data//02.2_Task_SmallData.xlsx'

In [114]:
# Read the Excel file
df_Task_SmallData = pd.read_excel(file)
df_Task_SmallData.head()

   OrderID Order Date Product  Size (US) Colour  Price ($)
0       10 2015-01-04   Boots         12  Black         25
1        7 2015-01-03   Boots         10  Black         25
2        8 2015-01-03   Boots          9  Black         25
3       11 2015-01-05   Boots          7  Black         25
4        2 2015-01-02   Boots          4  Black         25

In [115]:
# Display the WorkSheet names
df = pd.ExcelFile(file)
df.sheet_names

['Small Data', 'Large Data']

In [116]:
# Read the data from a worksheet into its own dataframe
df_categories = pd.read_excel(file, 'Small Data')
df_categories = pd.read_excel(file, 'Large Data')
df_categories.head()

,OrderID,Order Date,Product,Size (US),Colour,Price ($),Store,Returned,Gender
0,1,2015-01-02,Boots,7,Gold,25,California,Yes,Female
1,2,2015-01-02,Boots,4,Black,25,New York,NaN,Female
2,3,2015-01-02,Boots,6,Red,25,Georgia,NaN,Female
3,4,2015-01-03,House Slippers,11,Black,8,Internet,NaN,Female
4,5,2015-01-03,Boots,6,Silver,25,California,NaN,Female

In [117]:
# Display the first five rows of the Dataframe
df_categories.head()

,OrderID,Order Date,Product,Size (US),Colour,Price ($),Store,Returned,Gender
0,1,2015-01-02,Boots,7,Gold,25,California,Yes,Female
1,2,2015-01-02,Boots,4,Black,25,New York,NaN,Female
2,3,2015-01-02,Boots,6,Red,25,Georgia,NaN,Female
3,4,2015-01-03,House Slippers,11,Black,8,Internet,NaN,Female
4,5,2015-01-03,Boots,6,Silver,25,California,NaN,Female

In [118]:
# Show the data types of the columns in the dataframe
df_categories.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
Store                 object
Returned              object
Gender                object
dtype: object

# Ex 3.1

### Part 1

1. Read the data from the **Femalelist.csv**   
2. Name the pandas Dataframe:  *df_female_customers*  
2. Display just the first five rows of the dataframe  
4. Show the data types of the columns in the dataframe

In [119]:
# Read the csv file into a pandas dataframe
# Note: This file is in the Data folder underneath this folder 
df = pd.read_csv('Data//Femalelist.csv')
# Display the first five records/rows in the dataframe
df.head()

      Name Sex  Age  Height  Weight
0    Alice   F   13    56.5    84.0
1  Barbara   F   13    65.3    98.0
2    Carol   F   14    62.8   102.5
3     Jane   F   12    59.8    84.5
4    Janet   F   15    62.5   112.5

In [120]:
# Show the data types of the columns in the dataframe
df_categories.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
Store                 object
Returned              object
Gender                object
dtype: object

### Part 2

1. Load the data from the *Large Data* worksheet  of the **02.2_Task_SmallData.xlsx** Excel file.  
2. Name the pandas Dataframe:  *df_Part2* 
3. Display just the first five rows of the dataframe  
4. Show the data types of the columns in the dataframe

In [121]:
# Set path to Excel file
file = 'Data//02.2_Task_SmallData.xlsx'

In [122]:
# Read the Excel file
df = pd.ExcelFile(file)
# Display the WorkSheet names
df.sheet_names

['Small Data', 'Large Data']

In [123]:
# Read the data from a worksheet into its own dataframe
df_categories = pd.read_excel(file,'Small Data')
df_categories = pd.read_excel(file,'Large Data')
# Display the first five records of the dataframe
df_categories.head()

,OrderID,Order Date,Product,Size (US),Colour,Price ($),Store,Returned,Gender
0,1,2015-01-02,Boots,7,Gold,25,California,Yes,Female
1,2,2015-01-02,Boots,4,Black,25,New York,NaN,Female
2,3,2015-01-02,Boots,6,Red,25,Georgia,NaN,Female
3,4,2015-01-03,House Slippers,11,Black,8,Internet,NaN,Female
4,5,2015-01-03,Boots,6,Silver,25,California,NaN,Female

In [124]:
# Look at the data types for the household data
df_categories.dtypes

OrderID                int64
Order Date    datetime64[ns]
Product               object
Size (US)              int64
Colour                object
Price ($)              int64
Store                 object
Returned              object
Gender                object
dtype: object

## Part 3
- Excel Filename:  w3schools_Data_Updated.xlsx 
- Worksheet: Orders

1. Load the data into a pandas dataframe named:  *df_W3_orders*   
3. Display just the first five rows of the dataframe  
4. Show the data types of the columns in the dataframe

In [125]:
# Set path to Excel file
file = 'Data//w3schools_Data_Updated.xlsx'

In [126]:
# Read the Excel file
df = pd.ExcelFile(file)

# Display the WorkSheet names
df.sheet_names

['Customers',
 'Categories',
 'Employees',
 'OrderDetails',
 'Orders',
 'Products',
 'Shippers',
 'Suppliers']

In [127]:
# Read the data from a worksheet into its own dataframe
df_W3_categories = pd.read_excel(file, 'Categories')
df_W3_categories.head()

,CategoryID,CategoryName,Description
0,1,Beverages,"Soft drinks, coffees, teas, beers, and ales"
1,2,Condiments,"Sweet and savory sauces, relishes, spreads, an..."
2,3,Confections,"Desserts, candies, and sweet breads"
3,4,Dairy Products,Cheeses
4,5,Grains/Cereals,"Breads, crackers, pasta, and cereal"